In [2]:
import numpy as np
import pandas as pd

In [2]:
#NaN
#Nan = not a number

SyntaxError: invalid syntax (<ipython-input-2-f9d34ddc14a2>, line 1)

In [3]:
x = pd.DataFrame([['Zoe', 32, np.nan, 59, 'banana'],
                  ['Sam', np.nan, 'M', np.nan, 'peach'],
                  ['Danny', 46, 'M', 81, 'apple']], columns=['name', 'age', 'sex', 'grade', 'fruit'])
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [4]:
x.isnull()

    name    age    sex  grade  fruit
0  False  False   True  False  False
1  False   True  False   True  False
2  False  False  False  False  False

In [5]:
x.isnull().sum()

name     0
age      1
sex      1
grade    1
fruit    0
dtype: int64

In [6]:
x.isna().sum()

name     0
age      1
sex      1
grade    1
fruit    0
dtype: int64

In [7]:
x.notnull()

   name    age    sex  grade  fruit
0  True   True  False   True   True
1  True  False   True  False   True
2  True   True   True   True   True

In [8]:
x.notnull().sum()

name     3
age      2
sex      2
grade    2
fruit    3
dtype: int64

In [9]:
x.dropna() #只要有nan的row都清除掉

    name   age sex  grade  fruit
2  Danny  46.0   M   81.0  apple

In [10]:
x.dropna(subset=['sex'])

    name   age sex  grade  fruit
1    Sam   NaN   M    NaN  peach
2  Danny  46.0   M   81.0  apple

In [11]:
x.fillna(99)

    name   age sex  grade   fruit
0    Zoe  32.0  99   59.0  banana
1    Sam  99.0   M   99.0   peach
2  Danny  46.0   M   81.0   apple

In [14]:
x.fillna(x.mean())

<ipython-input-14-db3813443cc9>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  x.fillna(x.mean())

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam  39.0    M   70.0   peach
2  Danny  46.0    M   81.0   apple

In [15]:
x.fillna(x.min())

<ipython-input-15-e931a9d76032>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  x.fillna(x.min())

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam  32.0    M   59.0   peach
2  Danny  46.0    M   81.0   apple

In [16]:
x.fillna(x.max())

<ipython-input-16-c54e4dcc1547>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  x.fillna(x.max())

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam  46.0    M   81.0   peach
2  Danny  46.0    M   81.0   apple

In [17]:
x['age'].fillna(0)

0    32.0
1     0.0
2    46.0
Name: age, dtype: float64

In [51]:
x.fillna({'age':22,'sex':'F','grade':44})

    name   age sex  grade   fruit grade_map grade_apply
0    Zoe  32.0   F   59.0  banana         F           F
1    Sam  22.0   M   44.0   peach         A           A
2  Danny  46.0   M   81.0   apple         B           B

In [19]:
#append
x.append(x)

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [20]:
x.append(x,ignore_index=True)

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple
3    Zoe  32.0  NaN   59.0  banana
4    Sam   NaN    M    NaN   peach
5  Danny  46.0    M   81.0   apple

In [23]:
x=x.set_index('name')
x

In [24]:
x.loc['Zoe']

age        32.0
sex         NaN
grade      59.0
fruit    banana
Name: Zoe, dtype: object

In [25]:
x=x.reset_index()
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [26]:
x =x.append(x,ignore_index=True)
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple
3    Zoe  32.0  NaN   59.0  banana
4    Sam   NaN    M    NaN   peach
5  Danny  46.0    M   81.0   apple

In [27]:
x.drop_duplicates()

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [28]:
x.drop_duplicates('name')

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [29]:
x.drop_duplicates('sex')

  name   age  sex  grade   fruit
0  Zoe  32.0  NaN   59.0  banana
1  Sam   NaN    M    NaN   peach

In [30]:
x.drop_duplicates(keep='first')

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [31]:
x.drop_duplicates(keep='last')

    name   age  sex  grade   fruit
3    Zoe  32.0  NaN   59.0  banana
4    Sam   NaN    M    NaN   peach
5  Danny  46.0    M   81.0   apple

In [33]:
x=x.drop_duplicates()

In [42]:
x=x.fillna({'sex':'F','grade':65})
x

    name   age sex  grade   fruit  sex_map
0    Zoe  32.0   F   59.0  banana      NaN
1    Sam   NaN   M   65.0   peach      1.0
2  Danny  46.0   M   81.0   apple      1.0

In [43]:
sex ={'M':1,'F':0}
x['sex_map']=x['sex'].map(sex)
x

    name   age sex  grade   fruit  sex_map
0    Zoe  32.0   F   59.0  banana        0
1    Sam   NaN   M   65.0   peach        1
2  Danny  46.0   M   81.0   apple        1

In [55]:
def letter_grade(g):
    if g<60:
        letter = 'F'
    elif g == np.nan:
        letter = 'G'
    elif g<70:
        letter = 'D'
    elif g<80:
        letter = 'C'
    elif g<90:
        letter = 'B'
    else:
        letter = 'A'
    return letter

In [56]:
x['grade_map'] = x['grade'].map(letter_grade)
x

    name   age  sex  grade   fruit grade_map grade_apply
0    Zoe  32.0  NaN   59.0  banana         F           F
1    Sam   NaN    M    NaN   peach         A           A
2  Danny  46.0    M   81.0   apple         B           B

In [52]:
x['grade_apply'] = x['grade'].apply(letter_grade)
x

    name   age  sex  grade   fruit grade_map grade_apply
0    Zoe  32.0  NaN   59.0  banana         F           F
1    Sam   NaN    M    NaN   peach         A           A
2  Danny  46.0    M   81.0   apple         B           B

In [6]:
#one-hot encoding
pd.get_dummies(x['fruit'])

   apple  banana  peach
0      0       1      0
1      0       0      1
2      1       0      0

In [7]:
#cut
grades = [45, 82, 56, 77, 90, 69, 72, 79, 85, 95, 62, 65]

In [8]:
pd.cut(grades,5) #最大減最小，剪成五組

[(44.95, 55.0], (75.0, 85.0], (55.0, 65.0], (75.0, 85.0], (85.0, 95.0], ..., (75.0, 85.0], (75.0, 85.0], (85.0, 95.0], (55.0, 65.0], (55.0, 65.0]]
Length: 12
Categories (5, interval[float64, right]): [(44.95, 55.0] < (55.0, 65.0] < (65.0, 75.0] < (75.0, 85.0] < (85.0, 95.0]]

In [10]:
df =pd.DataFrame({'grades':grades,'cut':pd.cut(grades,5)})
df

    grades            cut
0       45  (44.95, 55.0]
1       82   (75.0, 85.0]
2       56   (55.0, 65.0]
3       77   (75.0, 85.0]
4       90   (85.0, 95.0]
5       69   (65.0, 75.0]
6       72   (65.0, 75.0]
7       79   (75.0, 85.0]
8       85   (75.0, 85.0]
9       95   (85.0, 95.0]
10      62   (55.0, 65.0]
11      65   (55.0, 65.0]

In [11]:
df.iloc[0,1]

Interval(44.95, 55.0, closed='right')

In [14]:
df.iloc[1,1]

Interval(75.0, 85.0, closed='right')

In [15]:
df.iloc[0,1] <df.iloc[1,1]

True

In [16]:
df['cut'].value_counts()

(75.0, 85.0]     4
(55.0, 65.0]     3
(65.0, 75.0]     2
(85.0, 95.0]     2
(44.95, 55.0]    1
Name: cut, dtype: int64

In [19]:
df['letter_cut'] = pd.cut(grades,5,labels=['F','D','C','B','A'])
df

    grades            cut letter_cut
0       45  (44.95, 55.0]          F
1       82   (75.0, 85.0]          B
2       56   (55.0, 65.0]          D
3       77   (75.0, 85.0]          B
4       90   (85.0, 95.0]          A
5       69   (65.0, 75.0]          C
6       72   (65.0, 75.0]          C
7       79   (75.0, 85.0]          B
8       85   (75.0, 85.0]          B
9       95   (85.0, 95.0]          A
10      62   (55.0, 65.0]          D
11      65   (55.0, 65.0]          D

In [20]:
#qcut 盡可能平均分配區間的人數
pd.qcut(grades,5)

[(44.999, 62.6], (78.2, 84.4], (44.999, 62.6], (70.2, 78.2], (84.4, 95.0], ..., (78.2, 84.4], (84.4, 95.0], (84.4, 95.0], (44.999, 62.6], (62.6, 70.2]]
Length: 12
Categories (5, interval[float64, right]): [(44.999, 62.6] < (62.6, 70.2] < (70.2, 78.2] < (78.2, 84.4] < (84.4, 95.0]]

In [22]:
df['qcut']=pd.qcut(grades,5)
df

    grades            cut letter_cut            qcut
0       45  (44.95, 55.0]          F  (44.999, 62.6]
1       82   (75.0, 85.0]          B    (78.2, 84.4]
2       56   (55.0, 65.0]          D  (44.999, 62.6]
3       77   (75.0, 85.0]          B    (70.2, 78.2]
4       90   (85.0, 95.0]          A    (84.4, 95.0]
5       69   (65.0, 75.0]          C    (62.6, 70.2]
6       72   (65.0, 75.0]          C    (70.2, 78.2]
7       79   (75.0, 85.0]          B    (78.2, 84.4]
8       85   (75.0, 85.0]          B    (84.4, 95.0]
9       95   (85.0, 95.0]          A    (84.4, 95.0]
10      62   (55.0, 65.0]          D  (44.999, 62.6]
11      65   (55.0, 65.0]          D    (62.6, 70.2]

In [23]:
df['qcut'].value_counts()

(44.999, 62.6]    3
(84.4, 95.0]      3
(62.6, 70.2]      2
(70.2, 78.2]      2
(78.2, 84.4]      2
Name: qcut, dtype: int64

In [24]:
df['cut'].value_counts()

(75.0, 85.0]     4
(55.0, 65.0]     3
(65.0, 75.0]     2
(85.0, 95.0]     2
(44.95, 55.0]    1
Name: cut, dtype: int64

In [25]:
df['letter_qcut'] = pd.qcut(grades,5,labels=['F','D','C','B','A'])
df

    grades            cut letter_cut            qcut letter_qcut
0       45  (44.95, 55.0]          F  (44.999, 62.6]           F
1       82   (75.0, 85.0]          B    (78.2, 84.4]           B
2       56   (55.0, 65.0]          D  (44.999, 62.6]           F
3       77   (75.0, 85.0]          B    (70.2, 78.2]           C
4       90   (85.0, 95.0]          A    (84.4, 95.0]           A
5       69   (65.0, 75.0]          C    (62.6, 70.2]           D
6       72   (65.0, 75.0]          C    (70.2, 78.2]           C
7       79   (75.0, 85.0]          B    (78.2, 84.4]           B
8       85   (75.0, 85.0]          B    (84.4, 95.0]           A
9       95   (85.0, 95.0]          A    (84.4, 95.0]           A
10      62   (55.0, 65.0]          D  (44.999, 62.6]           F
11      65   (55.0, 65.0]          D    (62.6, 70.2]           D